
{
    "entry": [
        "Hey, person!",
        "I am starving, I fear to die very soon and my light will go out forever. @help !sad"
    ],
    "help": [
        "Would you help me out, kind stranger?",
        ">Oh my God, a talking fire?! @impressed",
        ">Why should I help you? @why",
        ">How can I help you? @how",
        ">I don't care !angry",
        "Oh you son of a ...! No, sorry, I get it. Well, maybe another time. !neutral",
        "Just be aware this whole game is pretty pointless if you don't help me out... @help !end"
    ],
    "impressed": [
        "Well yes, I'm impressed too. Took me some time to get used to it. @help !amused"
    ],
    "how": [
        "I really need some wood. Surely a strong and marvelous man like you can help an old fire out.",
        ">Sounds boring. Maybe later @bye",
        ">I'm in. @details",
        ">I'm not a man @notaman",
        ">What do we say to the god of Fire?",
        "I don't know, what?",
        ">Not today!",
        "But if you don't help me out, there may not be a tomorrow @why"
    ],
    "notaman": [
        "Neither am I, we have so much in common! So will you help me? With the wood? !amused",
        ">Of course! @details",
        ">I'd rather not get involved",
        "Yes you do !angry",
        "Sorry, I mean, you should really help me because otherwise your existence here would be boring !amused",
        ">Why? @existence"
    ],
    "why": [
        "Because I am the essence of life. If I die, everything dies. Do you want everything to die?",
        ">Oh, I wouldn't want to be responsible for that! @details",
        ">I don't know, do I?",
        ">Yes",
        "No!",
        ">OK",
        "So you'll help me then?",
        ">Definitely! @details",
        ">Do I even have a choice?",
        "Technically yes. Practically deciding against it would be a little stupid though.",
        ">Well OK then, you convinced me. @details",
        ">Why? @existence"
    ],
    "existence": [
        "Because your sole existence in this world hinges on helping to keep me alive.",
        "That's why you're here. There's nothing else to do for you anyway.",
        ">Cool! I'll help you. @details",
        ">I'd rather think about this in private @bye"
    ],
    "bye": [
        "Sure, take your time. You'll come back eventually! @help !end"
    ],
    "details": [
        "Great! I knew I could rely on you. I know a good person when I see one!",
        ">So what exactly should I do?",
        "It's easy! I just need a little firewood so I can keep burning for some longer.",
        ">I can get you some wood!",
        "Yes yes! But it needs to be special kind of wood.",
        "There's a good tree in the East. His wood is good. !treezoom",
        "Go get it! !enable tree tree1",
        ">Sure thing! @reminder !end"
    ],
    "reminder": [
        "Hello again!",
        ">What do I need to do?",
        ">Bye @reminder !end",
        "Go to East. Ask tree for wood. Bring me wood. Soon!",
        ">On my way! @reminder !end"
    ]
}
