{
    "entry": [
        "Your little dance amuses me. @amuse",
        ">Thanks for the compliment! @smile",
        ">There is nothing like putting a smile on a tree's face. How are you? @smile ",
        ">How dare you?! @dare"
    ],
    "dare": [
        "Oh you pesky human! Can't even take a compliment!@entry !end"
    ],
    "nothelpfull": [
        "Oh you gnarly individual. I should have never trusted you in the first place... @entry !end"
    ],
    "smile": [
        "You seem like a decent lad! Maybe you can help me out with something.",
        ">Sure! @sure",
        ">What is it? @sure"
    ],
    "sure": [
        "I'm an old tree. I don't have any children.",
        "My pine cones never amount to anything...",
        "I could really need your help. With procreation.",
        ">I'd love that! @lovethat",
        ">Isn't that a little... weird? @weird",
        ">Why do you want offspring so badly? @sobadly",
        ">Oh no! What happens to your pine cones? @pinecones",
        ">Nah I'm not really the helpful kind. @nothelpfull"
    ],
    "pinecones": [
        "Well that's a super long story.",
        "But I'll gladly tell you, little one.",
        ">Um, nevermind. @nevermind",
        ">Cool! @cool"
    ],
    "lovethat": [
        "I figured it all out.",
        "The only way I can get a son is if you plant one of my pine cones on the mountain in the West.",
        "Would you do that for me?",
        ">Definitely! @definitly",
        ">Ain't nobody got time for that! @notime"
    ],
    "weird": [
        "Oh you judgemental humanoid! Show some empathy! @entry !end"
    ],
    "sobadly": [
        "Oh you nosy little meat sack! Mind your own business! @entry !end"
    ],
    "notime": [
        "Oh you are not a very helpful lifeform! @entry !end"
    ],
    "nevermind": [
        "Oh you rude leafless imposter! Won't even listen to my sad, sad story. @entry !end"
    ],
    "definitly": [
        "awesome @missinggear !spawnseed !end"
    ],
    "missinggear": [
        "Oh, and I almost forgot!",
        "You will need some special gear to be able to climb that mountain. I hereby grant my personal pair of double jump boots!",
        ">Awesome, thanks! !doublejump @reminder !end"
    ],
    "cool": [
        "So the thing with pine cones, you see, is they need very special fertile ground to grow.",
        "Have you looked down? The soil here is rubbish. Nothing can grow here. No nutrients!",
        "Which, ironically, is why I'm too weak to throw my pine cones far enough onto better grounds.",
        "A vicious circle of non-procreation!",
        "So I need somebody to carry my pine cone to the best possible place in the area.",
        "I just want my child to have it easier than me, you know?",
        ">Definitely! @definitly",
        ">Ain't nobody got time for that! @notime"
    ],
    "reminder": [
        "You know, you wanted to help me procreate. Bring my cone to the highest place in this area @reminder !end",
        ">Got it! @reminder !end",
        ">Sorry, I lost your cone!",
        "You did... what? Thank god I have an unlimited supply of them. @reminder !spawnseed !end"

    ]
}
