{
    "entry": [
        "[visited]You again...",
        "[not visited]How did you get up here...?",
        ">[not visited]Via jumping. @jumping",
        ">You... look like a flying ability power-up. @pickup",
        ">[$seedplanted]Do you know anything about growing seeds? @seed",
        ">[$seedgrown]I did it, the seed has grown. @grown",
        ">[not visited]What a strange person... ",
        ">[visited]Bye power-up. @dontcallmethat",
        "Whatever. @entry !end"
    ],
    "dontcallmethat": [
        "Don't call me that! @entry !end"
    ],
    "jumping": [
        "Aw man, another one of the multi-jump gang. Flying is better and you know it. !set visited",
        ">There was no flying ability available. @noflying",
        ">I like the multi-jump.",
        "Yeah, you look like someone who would. @entry"
    ],
    "noflying": [
        "That's because I'm up here and don't let strangers touch me. That includes you! @entry !end"
    ],
    "pickup": [
        "[$ismale]And you look like generic action guy.",
        "[not $ismale]And you look like a random japanese school girl.",
        "Go be generic somewhere else, it's unbearable. !set visited",
        ">Don't change the subject. You're even glowing.",
        ">Ouch! The truth hurts. @entry",
        "Yeah so? That's none of your business and as if you needed a flying ability in the first place!",
        "I bet you got one of those multi-jump things! Even birds are falling for this scam nowadays.",
        ">Guilty as charged.",
        "I guessed so. @entry"
    ],
    "seed": [
        "Seeds? What is there to know? Just put the thing in dirt and pour some water over it !set visited",
        "If you need water, just use the rain cloud to your left.",
        ">How?",
        "I usually just punch the thing right in the face. Psychological abuse works as well.",
        ">Are there peaceful options as well?",
        "Yeah, I heard something about rain dancing on top of the cloud to your left. But that's for people without anger issues.",
        ">Thanks... seek help",
        "Great advice, mom! @entry"
    ],
    "grown": [
        "What a great achievement. I'm so proud of you. !set visited",
        ">Thanks!",
        ">Are you being sarcastic? @sarcastic",
        "That was sarcasm. I couldn't care less. @entry"
    ],
    "sarcastic": [
        "Oh no, I have been found out!",
        ">Shame on you!",
        "I couldn't care less. @entry"
    ]
}
